repetier/Repetier-Firmware/src/Repetier/src/boards/STM32F1/HAL.cpp
/*
 Moses - renaming the timer interrupt handlers in the CMSIS startup file
 and then using them manually rather than HardwareTimer/HAL yields a 
 performance increase. (We steal them back since they're used by HardwareTimer)
 STM32F103RCT6 (SKR Mini E3) - Switching a pin HIGH upon entering the motion3
 timer (TIM6_IRQHandler here), LOW right before exiting @ 150khz 

 Using HardwareTimer callbacks: 3.364us
 Using raw IRQ's here:   1.362us
 
 (HardwareTimer tested by writing the pin high/low inside of HardwareTimer.cpp
  and inside it's TIM6_IRQHandler.)
*/

extern "C" void TIMER_VECTOR(MOTION2_TIMER_NUM);
extern "C" void TIMER_VECTOR(MOTION3_TIMER_NUM);
extern "C" void TIMER_VECTOR(PWM_TIMER_NUM);
extern "C" void TIMER_VECTOR(TONE_TIMER_NUM);

#if NUM_SERVOS > 0 || NUM_BEEPERS > 0
extern void servoOffTimer();
extern "C" void TIMER_VECTOR(SERVO_TIMER_NUM);
static uint32_t ServoPrescalerfactor = 20000;
static uint32_t Servo2500 = 2500;
#endif

void HAL::hwSetup(void) {
    updateStartReason();
#if DEBUG_TIMING
    SET_OUTPUT(DEBUG_ISR_STEPPER_PIN);
    SET_OUTPUT(DEBUG_ISR_MOTION_PIN);
    SET_OUTPUT(DEBUG_ISR_TEMP_PIN);
    SET_OUTPUT(DEBUG_ISR_ANALOG_PIN);
#endif
    // Servo control
#if NUM_SERVOS > 0 || NUM_BEEPERS > 0
    servo = reserveTimerInterrupt(SERVO_TIMER_NUM); // prevent pwm usage
    servo->timer = new HardwareTimer(TIMER(SERVO_TIMER_NUM));
    servo->timer->setMode(1, TIMER_OUTPUT_COMPARE, NC);
    servo->timer->setOverflow(200, HERTZ_FORMAT);

    LL_TIM_OC_EnableFast(TIMER(SERVO_TIMER_NUM), servo->timer->getLLChannel(1));
    LL_TIM_OC_EnablePreload(TIMER(SERVO_TIMER_NUM), servo->timer->getLLChannel(1));

    servo->timer->attachInterrupt(TIMER_VECTOR_NAME(SERVO_TIMER_NUM));
    servo->timer->attachInterrupt(1, &servoOffTimer);

    servo->timer->refresh();
    servo->timer->resume();

    ServoPrescalerfactor = (LL_TIM_GetPrescaler(servo->tim) + 1);
    Servo2500 = ((2500 * (servo->timer->getTimerClkFreq() / 1000000)) / ServoPrescalerfactor) - 1;
    HAL_NVIC_SetPriority(TIMER_IRQ(SERVO_TIMER_NUM), 3, 0);
#endif

#if defined(TWI_CLOCK_FREQ) && TWI_CLOCK_FREQ > 0 //init i2c if we have a frequency
    HAL::i2cInit(TWI_CLOCK_FREQ);
#endif
    // make debugging startup easier
    //Serial.begin(115200);

#if EEPROM_AVAILABLE && EEPROM_MODE != EEPROM_NONE && EEPROM_AVAILABLE != EEPROM_SDCARD && EEPROM_AVAILABLE != EEPROM_FLASH
    // Copy eeprom to ram for faster access
    int i;
    for (i = 0; i < EEPROM_BYTES; i += 4) {
        eeval_t v = eprGetValue(i, 4);
        memcopy4(&virtualEeprom[i], &v.i);
    }
#else
    memset(virtualEeprom, 0, EEPROM_BYTES);
#endif
#if EEPROM_AVAILABLE == EEPROM_FLASH && EEPROM_MODE != EEPROM_NONE
    FEInit();
#endif
}

// Set up all timer interrupts
void HAL::setupTimer() {

    /*!< 4 bits for pre-emption priority (0-15) 0 bits for subpriority */
    HAL_NVIC_SetPriorityGrouping(NVIC_PRIORITYGROUP_4);

    motion2 = reserveTimerInterrupt(MOTION2_TIMER_NUM); // prevent pwm usage
    motion2->timer = new HardwareTimer(TIMER(MOTION2_TIMER_NUM));
    motion2->timer->setMode(2, TIMER_OUTPUT_COMPARE);
    motion2->timer->setOverflow(PREPARE_FREQUENCY, HERTZ_FORMAT);
    motion2->timer->attachInterrupt(TIMER_VECTOR_NAME(MOTION2_TIMER_NUM));
    motion2->timer->resume();
    HAL_NVIC_SetPriority(TIMER_IRQ(MOTION2_TIMER_NUM), 4, 0);

    // Regular interrupts for heater control etc

    pwm = reserveTimerInterrupt(PWM_TIMER_NUM); // prevent pwm usage
    pwm->timer = new HardwareTimer(TIMER(PWM_TIMER_NUM));
    pwm->timer->setMode(2, TIMER_OUTPUT_COMPARE);
    pwm->timer->setOverflow(PWM_CLOCK_FREQ, HERTZ_FORMAT);
    pwm->timer->attachInterrupt(TIMER_VECTOR_NAME(PWM_TIMER_NUM));
    pwm->timer->resume();
    HAL_NVIC_SetPriority(TIMER_IRQ(PWM_TIMER_NUM), 5, 0);

    // Timer for stepper motor control

    motion3 = reserveTimerInterrupt(MOTION3_TIMER_NUM); // prevent pwm usage
    motion3->timer = new HardwareTimer(TIMER(MOTION3_TIMER_NUM));
    motion3->timer->setMode(2, TIMER_OUTPUT_COMPARE);
    motion3->timer->setOverflow(STEPPER_FREQUENCY, HERTZ_FORMAT);
    motion3->timer->attachInterrupt(TIMER_VECTOR_NAME(MOTION3_TIMER_NUM));
    motion3->timer->resume();
    HAL_NVIC_SetPriority(TIMER_IRQ(MOTION3_TIMER_NUM), 0, 0); // highest priority required!

#if NUM_BEEPERS > 0
    for (int i = 0; i < NUM_BEEPERS; i++) {
        if (beepers[i]->getOutputType() == 1) {
            // If we have any SW beepers, enable the beeper IRQ
            toneTimer = reserveTimerInterrupt(TONE_TIMER_NUM); // prevent pwm usage
            toneTimer->timer = new HardwareTimer(TIMER(TONE_TIMER_NUM));
            toneTimer->timer->setMode(1, TIMER_OUTPUT_COMPARE, NC);
            toneTimer->timer->attachInterrupt(TIMER_VECTOR_NAME(TONE_TIMER_NUM));
            toneTimer->timer->attachInterrupt(2, [] {});
            // Not on by default for output_compare
            LL_TIM_OC_EnablePreload(TIMER(TONE_TIMER_NUM), toneTimer->timer->getLLChannel(1));
            LL_TIM_OC_EnableFast(TIMER(TONE_TIMER_NUM), toneTimer->timer->getLLChannel(1));
            toneTimer->timer->setInterruptPriority(2, 0);
            toneTimer->timer->refresh();
            toneTimer->timer->resume();
            break;
        }
    }
#endif
}

// Called within checkForPeriodicalActions (main loop, more or less) 
// as fast as possible
void HAL::handlePeriodical() {

}
// Try to initialize pinNumber as hardware PWM. Returns internal
// id if it succeeds or -1 if it fails. Typical reasons to fail
// are no pwm support for that pin or an other pin uses same PWM
// channel.
int HAL::initHardwarePWM(int pinNumber, uint32_t frequency) {
    if (pinNumber < 0 || !frequency) {
        return -1;
    }
    PinName p = digitalPinToPinName(pinNumber);
    if (p != NC) {
        const PinMap* map = PinMap_PWM;
        while (map->pin != NC) {
            if (map->pin == p) {
                break;
            }
            map++;
        }
        if (map->pin != NC) {
            TimerFunction* tf = nullptr;
            for (int i = 0; i < NUM_TIMERS; i++) {
                if (timerList[i].tim == map->peripheral) {
                    tf = &timerList[i];
                    break;
                }
            }
            if (tf == nullptr || tf->usage == TimerUsage::INTERRUPT_TIMER) {
                return -1; // already used
            }
            if (tf->usage == TimerUsage::UNUSED) {
                tf->usage = TimerUsage::PWM_TIMER;
                tf->frequency = frequency;
                tf->reserved = 1;
            } else {
                tf->reserved++;
            }
            pwmEntries[numPWMEntries].function = tf;
            pwmEntries[numPWMEntries].map = map;
            // Find timer in local usage list

            TIM_TypeDef* Instance = (TIM_TypeDef*)tf->tim;
            HardwareTimer* HT;
            uint32_t index = get_timer_index(tf->tim);
            if (HardwareTimer_Handle[index] == nullptr) {
                HardwareTimer_Handle[index]->__this = new HardwareTimer((TIM_TypeDef*)map->peripheral);
            }

            HT = (HardwareTimer*)(HardwareTimer_Handle[index]->__this);
            pwmEntries[numPWMEntries].ht = HT;
            uint32_t channel = STM_PIN_CHANNEL(map->function);
            pinMode(pinNumber, OUTPUT);
            digitalWrite(pinNumber, LOW);

            // preloading on by default as of 1.9.0 (4.10900.200819)
            HT->setMode(channel, TIMER_OUTPUT_COMPARE_PWM1, p);
            HT->setOverflow(tf->frequency, HERTZ_FORMAT);

            // Not enabled by default for PWM.
            LL_TIM_OC_EnableFast(tf->tim, HT->getLLChannel(channel));

            HT->refresh();
            HT->resume();
            return numPWMEntries++;
        }
    }
    return -1;
}
// Set pwm output to value. id is id from initHardwarePWM.
void HAL::setHardwarePWM(int id, int value) {
    if (id < 0 || id >= 50) { // illegal id
        return;
    }
    PWMEntry& entry = pwmEntries[id];
    entry.ht->setCaptureCompare(STM_PIN_CHANNEL(entry.map->function), value, RESOLUTION_8B_COMPARE_FORMAT);
}

void HAL::setHardwareFrequency(int id, uint32_t frequency) {
    if (id < 0 || id >= 50 || !frequency) { // illegal id
        return;
    }
    pwmEntries[id].ht->setOverflow(frequency, HERTZ_FORMAT);
}

ADC_HandleTypeDef AdcHandle = {};
struct AnalogFunction {
    bool enabled;
    int32_t channel;
    int32_t lastValue;
    ADC_TypeDef* def;
    int32_t pin;
};

// Initialize ADC channels
static AnalogFunction analogValues[NUM_ANALOG_INPUTS] = { false, -1, 0, nullptr, -1 };
static AnalogFunction* analogMap[300] = { nullptr }; // Map pin number to entry in analogValues
int numAnalogInputs = 0;
uint16_t adcData[NUM_ANALOG_INPUTS] = { 0 }; // Target for DMA adc transfer

void reportAnalog() {
    for (int i = 0; i < 300; i++) {
        if (analogMap[i]) {
            Com::printF("Analog ", i);
            Com::printFLN(" = ", static_cast<int32_t>(analogMap[i]->lastValue));
        }
    }
    for (int i = 0; i < numAnalogInputs; i++) {
        Com::printF("adc ", i);
        Com::printF(" channel ", analogValues[i].channel);
        Com::printF(" pin ", analogValues[i].pin);
        Com::printFLN(", val = ", static_cast<int32_t>(adcData[i]));
    }
}

