repetier/Repetier-Firmware/src/Repetier/src/boards/STM32F1/HAL.cpp
void HAL::updateStartReason() {
    if (__HAL_RCC_GET_FLAG(RCC_FLAG_LPWRRST)) {
        startReason = BootReason::LOW_POWER;
    } else if (__HAL_RCC_GET_FLAG(RCC_FLAG_WWDGRST)
               || __HAL_RCC_GET_FLAG(RCC_FLAG_IWDGRST)) {
        startReason = BootReason::WATCHDOG_RESET;
    } else if (__HAL_RCC_GET_FLAG(RCC_FLAG_SFTRST)) {
        startReason = BootReason::SOFTWARE_RESET;
    } else if (__HAL_RCC_GET_FLAG(RCC_FLAG_PORRST)) {
        startReason = BootReason::POWER_UP;
    } else if (__HAL_RCC_GET_FLAG(RCC_FLAG_PINRST)) {
        startReason = BootReason::EXTERNAL_PIN;
    } else {
        startReason = BootReason::UNKNOWN;
    }
    // Clear all the reset flags or else they will remain set during future resets until system power is fully removed.
    __HAL_RCC_CLEAR_RESET_FLAGS();
}
// Print apparent cause of start/restart
void HAL::showStartReason() {
    if (startReason == BootReason::LOW_POWER) {
        Com::printInfoFLN(PSTR("Low power reset"));
    } else if (startReason == BootReason::WATCHDOG_RESET) {
        Com::printInfoFLN(Com::tWatchdog);
    } else if (startReason == BootReason::SOFTWARE_RESET) {
        Com::printInfoFLN(PSTR("Software reset"));
    } else if (startReason == BootReason::POWER_UP) {
        Com::printInfoFLN(Com::tPowerUp);
    } else if (startReason == BootReason::EXTERNAL_PIN) {
        Com::printInfoFLN(PSTR("External reset pin reset"));
    } else {
        Com::printInfoFLN(PSTR("Unknown reset reason"));
    }
}

// Return available memory
int HAL::getFreeRam() {
    struct mallinfo memstruct = mallinfo();
    register char* stack_ptr asm("sp");

    // avail mem in heap + (bottom of stack addr - end of heap addr)
    return (memstruct.fordblks + (int)stack_ptr - (int)sbrk(0));
}

// Reset peripherals and cpu
void HAL::resetHardware() {
    NVIC_SystemReset();
}

/****************************************************************************************
 Setting for I2C Clock speed. needed to change  clock speed for different peripherals
****************************************************************************************/

void HAL::i2cSetClockspeed(uint32_t clockSpeedHz) {
#if defined(WIRE_PORT) && !defined(HAL_I2C_MODULE_DISABLED)
    WIRE_PORT.setClock(clockSpeedHz);
#endif
}

/*************************************************************************
 Initialization of the I2C bus interface. Need to be called only once
*************************************************************************/
void HAL::i2cInit(uint32_t clockSpeedHz) {
#if defined(WIRE_PORT) && !defined(HAL_I2C_MODULE_DISABLED)
    WIRE_PORT.begin(); // create I2C master access
    WIRE_PORT.setClock(clockSpeedHz);
#endif
}

/*************************************************************************
  Issues a start condition and sends address and transfer direction.
*************************************************************************/
/* void HAL::i2cStart(uint8_t address) {
    WIRE_PORT.beginTransmission(address);
} */

void HAL::i2cStartRead(uint8_t address, uint8_t bytes) {
#if defined(WIRE_PORT) && !defined(HAL_I2C_MODULE_DISABLED)
    if (!i2cError) {
        i2cError |= (WIRE_PORT.requestFrom(address, bytes) != bytes);
    }
#endif
}
/*************************************************************************
 Issues a start condition and sends address and transfer direction.
 Also specifies internal address of device

 Input:   address and transfer direction of I2C device, internal address
*************************************************************************/
void HAL::i2cStartAddr(uint8_t address, unsigned int pos, uint8_t readBytes) {
#if defined(WIRE_PORT) && !defined(HAL_I2C_MODULE_DISABLED)
    if (!i2cError) {
        WIRE_PORT.beginTransmission(address);
        WIRE_PORT.write(pos >> 8);
        WIRE_PORT.write(pos & 255);
        if (readBytes) {
            i2cError |= WIRE_PORT.endTransmission();
            i2cError |= (WIRE_PORT.requestFrom(address, readBytes) != readBytes);
        }
    }
#endif
}

/*************************************************************************
 Terminates the data transfer and releases the I2C bus
*************************************************************************/
void HAL::i2cStop(void) {
#if defined(WIRE_PORT) && !defined(HAL_I2C_MODULE_DISABLED)
    i2cError |= WIRE_PORT.endTransmission();
#endif
}

/*************************************************************************
  Send one byte to I2C device

  Input:    byte to be transfered
*************************************************************************/
void HAL::i2cWrite(uint8_t data) {
#if defined(WIRE_PORT) && !defined(HAL_I2C_MODULE_DISABLED)
    if (!i2cError) {
        WIRE_PORT.write(data);
    }
#endif
}

/*************************************************************************
 Read one byte from the I2C device, request more data from device
 Return:  byte read from I2C device
*************************************************************************/
int HAL::i2cRead(void) {
#if defined(WIRE_PORT) && !defined(HAL_I2C_MODULE_DISABLED)
    if (!i2cError && WIRE_PORT.available()) {
        return WIRE_PORT.read();
    }
#endif
    return -1; // should never happen, but better then blocking
}

#if NUM_SERVOS > 0
unsigned int HAL::servoTimings[4] = { 0, 0, 0, 0 };
static unsigned int servoAutoOff[4] = { 0, 0, 0, 0 };
static uint8_t servoId = 0;
static ServoInterface* actServo = nullptr;

void HAL::servoMicroseconds(uint8_t servoId, int microsec, uint16_t autoOff) {
    if (servo) {
        servoTimings[servoId] = microsec ? ((microsec * (servo->timer->getTimerClkFreq() / 1000000)) / ServoPrescalerfactor) - 1 : 0;
        servoAutoOff[servoId] = (microsec) ? (autoOff / 20) : 0;
    }
}
#endif

// ================== Interrupt handling ======================

ServoInterface* analogServoSlots[4] = { nullptr, nullptr, nullptr, nullptr };
FORCE_INLINE void servoOffTimer() {
#if NUM_SERVOS > 0
    if (actServo) {
        actServo->disable();
        if (servoAutoOff[servoId]) {
            servoAutoOff[servoId]--;
            if (servoAutoOff[servoId] == 0) {
                HAL::servoTimings[servoId] = 0;
            }
        }
    }
    if (++servoId >= 4) {
        servoId = 0;
    }
    actServo = analogServoSlots[servoId];
    if (actServo == nullptr) {
        servo->tim->CCR1 = Servo2500;
    } else {
        // InterruptProtectedBlock noInt;
        unsigned int ms = HAL::servoTimings[servoId];
        if (ms) {
            servo->tim->CCR1 = ms;
        } else {
            servo->tim->CCR1 = Servo2500;
        }
    }
#endif
// Add all generated servo interrupt handlers
#undef IO_TARGET
#define IO_TARGET IO_TARGET_SERVO_INTERRUPT
#include "io/redefine.h"
}

// Servo timer Interrupt handler
void TIMER_VECTOR(SERVO_TIMER_NUM) {
#if NUM_SERVOS > 0 || NUM_BEEPERS > 0
    if (LL_TIM_IsActiveFlag_CC1(TIMER(SERVO_TIMER_NUM))) {
        LL_TIM_ClearFlag_CC1(TIMER(SERVO_TIMER_NUM));
        servoOffTimer();
    } else if (LL_TIM_IsActiveFlag_UPDATE(TIMER(SERVO_TIMER_NUM))) {
        LL_TIM_ClearFlag_UPDATE(TIMER(SERVO_TIMER_NUM));
#if NUM_SERVOS > 0
        if (actServo && HAL::servoTimings[servoId]) {
            actServo->enable();
        }
#endif
    }
#endif
}

/** \brief Timer interrupt routine to drive the stepper motors.
*/
void TIMER_VECTOR(MOTION3_TIMER_NUM) {
#if DEBUG_TIMING
    WRITE(DEBUG_ISR_STEPPER_PIN, 1);
#endif
    LL_TIM_ClearFlag_UPDATE(TIMER(MOTION3_TIMER_NUM));
    Motion3::timer();
#if DEBUG_TIMING
    WRITE(DEBUG_ISR_STEPPER_PIN, 0);
#endif
}

//at 10khz:
// 0       1       2        3        4
// 39.2Hz, 78.7Hz, 158.7Hz, 322.5Hz, 666.6Hz
ufast8_t pwmSteps[] = { 1, 2, 4, 8, 16 };
ufast8_t pwmMasks[] = { 255, 254, 252, 248, 240 };

/**
This timer is called 10000 times per second. It is used to update
pwm values for heater and some other frequent jobs.
*/

void TIMER_VECTOR(PWM_TIMER_NUM) {
#if DEBUG_TIMING
    WRITE(DEBUG_ISR_TEMP_PIN, 1);
#endif
    LL_TIM_ClearFlag_UPDATE(TIMER(PWM_TIMER_NUM));

